unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Milandr</vendor>
    <url></url>
    <name>MDR32FxQI</name>
    <description>Milandr MDR32FxQI Series Device Support, Drivers and Examples</description>
    <license>License.txt</license>


    <releases>
        <release version="1.3.2" date="2025-03-28">
Fix pdsc name to follow Pack Installer rules in Keil uVision 5.39.0.0.
        </release>
        <release version="1.3.1" date="2025-03-27">
Fix pack name to follow Pack Installer rules in Keil uVision 5.39.0.0.
        </release>
        <release version="1.3.0" date="2024-12-21">
Add new MCU support.
SPL MDR32FxQI libraries have been updated to version 1.3.0.
        </release>
        <release version="1.2.0" date="2024-02-02">
Added initial MDR1986VE94GI support.
SPL MDR32FxQI libraries have been updated to version 1.2.0.
        </release>
        <release version="1.1.0" date="2023-07-07">
The addition of the CMSIS_device_header preprocessor directive with the name of the CMSIS header file of the selected microcontroller in the RTE_Components.h file is enabled.
FLM files updated.
The SPL MDR32FxQI libraries have been updated to version 1.1.0.
        </release>
        <release version="1.0.0" date="2022-04-05">
Initial version
        </release>
    </releases>


    <keywords>
        <!-- keywords for indexing -->
        <keyword>Milandr</keyword>
        <keyword>MDR</keyword>
        <keyword>MDR32FxQI</keyword>
        <keyword>MDR32F1QI</keyword>
        <keyword>K1986VE1FI</keyword>
        <keyword>K1986VE1GI</keyword>
        <keyword>MDR32F9Q2I</keyword>
        <keyword>K1986VE92FI</keyword>
        <keyword>K1986VE92F1I</keyword>
        <keyword>MDR1986VE94GI</keyword>
        <keyword>MDR1209GI</keyword>
        <keyword>MDR32FG16S1QI</keyword>
    </keywords>


    <taxonomy>
        <description Cclass="Device">Startup, System Setup</description>
        <description Cclass="Drivers">Drivers for work with microcontroller peripherals</description>
    </taxonomy>


    <devices>
        <family Dfamily="Milandr" Dvendor="Milandr:99">
            <subFamily DsubFamily="Cortex-M1">
                <environment name="uv">
                    <AMisc>--cpreproc</AMisc>
                </environment>
                <!-- MDR32F1QI -->
                <device Dname="MDR32F1QI">
                    <processor Dcore="Cortex-M1" DcoreVersion="r1p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="144000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\inc\MDR32F1QI.h"/>
                    <debug      svd="IDE\SVD\MDR32F1QI.svd"/>
                    <memory     id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                           start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <memory     id="IRAM2"                           start="0x20100000" size="0x4000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\MDR32F1QI\MDR32F1QI.FLM"  start="0x00000000" size="0x20000" RAMstart="0x20100000" RAMsize="0x4000" default="1"/>
                    <description>
MDR32F1QI (K1986VE1QI RUS)
Core:
 - 32-bit RISC core, running at frequencies of up to 144 MHz
 - 0.8 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - 24-bit SysTick Timer

Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 48 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 20 ... 30 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Standby and StandAlone
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (16 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 12-bit DAC

Peripheral features:
 - DMA controller (32 channels)
 - USB 2.0 full-speed OTG controller (Device and Host)
 - 3 Synch. 32-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 2 * UART
 - 2 * SPI
 - Digital interface controller according to GOST 18977-79
 - Two digital interface controllers according to GOST R 52070-2003
 - Digital Controller Ethernet 10/100 PHY Transceiver
 - 96 GPIO pins

Debug mode:
 - JTAG and SWD
                    </description>
                </device>
                
                <!-- K1986VE1FI, K1986VE1GI -->
                <device Dname="K1986VE1xI">
                    <processor Dcore="Cortex-M1" DcoreVersion="r1p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="144000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\inc\K1986VE1xI.h"/>
                    <debug      svd="IDE\SVD\K1986VE1xI.svd"/>
                    <memory     id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                           start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <memory     id="IRAM2"                           start="0x20100000" size="0x4000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\K1986VE1xI\K1986VE1xI.FLM" start="0x00000000" size="0x20000" RAMstart="0x20100000" RAMsize="0x4000" default="1"/>
                    <description>
K1986VE1FI (MDR1213FI), K1986VE1GI (MDR1213GI)
Core:
 - 32-bit RISC core, running at frequencies of up to 144 MHz
 - 0.8 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - 24-bit SysTick Timer

