unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 48 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 20 ... 30 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Standby and StandAlone
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (16 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 12-bit DAC

Peripheral features:
 - DMA controller (32 channels)
 - USB 2.0 full-speed OTG controller (Device and Host)
 - 3 Synch. 32-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 2 * UART
 - 2 * SPI
 - Digital interface controller according to GOST 18977-79
 - Two digital interface controllers according to GOST R 52070-2003
 - Digital Controller Ethernet 10/100 PHY Transceiver
 - 96 GPIO pins

Debug mode:
 - JTAG and SWD
                    </description>
                </device>
            </subFamily>

            <subFamily DsubFamily="Cortex-M3">
                <environment name="uv">
                    <AMisc>--cpreproc</AMisc>
                </environment>
                <!-- MDR32F9Q2I -->
                <device Dname="MDR32F9Q2I">
                    <processor  Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="80000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\inc\MDR32F9Q2I.h"/>
                    <debug      svd="IDE\SVD\MDR32F9Q2I.svd"/>
                    <memory     id="IROM1"                           start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                           start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\MDR32F9Q2I\MDR32F9Q2I.FLM" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
                    <description>
MDR32F9Q2I (K1986BE92QI RUS)
Core:
 - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - memory Protection Unit (MPU)
 - 24-bit SysTick Timer

Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 32 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Stop and Standby
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (8 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 12-bit DAC
 - internal comparator

Peripheral features:
 - DMA controller (32 channels)
 - USB 1.0 full-speed controller (Device and Host)
 - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 2 * UART
 - 2 * SPI
 - 1 * I2C
 - 43 GPIO pins

Debug mode:
 - 2 * JTAG and SWD
                    </description>
                </device>
                
                <!-- K1986VE92FI, K1986VE92F1I -->
                <device Dname="K1986VE92xI">
                    <processor  Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="80000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\inc\K1986VE9xI.h"/>
                    <debug      svd="IDE\SVD\K1986VE9xI.svd"/>
                    <memory     id="IROM1"                           start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                           start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\K1986VE9xI\K1986VE9xI.FLM" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
                    <description>
K1986VE92FI (MDR1211FI), K1986VE92F1I (MDR1211F1I)
Core:
 - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - memory Protection Unit (MPU)
 - 24-bit SysTick Timer

Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 32 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Stop and Standby
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (8 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 12-bit DAC
 - internal comparator

Peripheral features:
 - DMA controller (32 channels)
 - USB 1.0 full-speed controller (Device and Host)
 - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 2 * UART
 - 2 * SPI
 - 1 * I2C
 - 43 GPIO pins

Debug mode:
 - 2 * JTAG and SWD
                    </description>
                </device>
                
                <!-- K1986VE94GI -->
                <device Dname="K1986VE94GI">
                    <processor  Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="80000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\inc\K1986VE9xI.h"/>
                    <debug      svd="IDE\SVD\K1986VE9xI.svd"/>
                    <memory     id="IROM1"                           start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                           start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\K1986VE9xI\K1986VE9xI.FLM" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
                    <description>
K1986VE94GI (MDR1209GI)
Core:
 - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - memory Protection Unit (MPU)
 - 24-bit SysTick Timer

