unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 32 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Stop and Standby
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (16 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 2 * 12-bit DAC
 - internal comparator

Peripheral features:
 - DMA controller (32 channels)
 - USB 1.0 full-speed controller (Device and Host)
 - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 2 * UART
 - 2 * SPI
 - 1 * I2C
 - 96 GPIO pins

Debug mode:
 - 2 * JTAG and SWD
                    </description>
                </device>
            </subFamily>

            <!-- RISC and DSP CORES -->
            <subFamily DsubFamily="Cortex-M3 with DSP">
                <environment name="uv">
                    <AMisc>--cpreproc</AMisc>
                </environment>
                <!-- MDR32FG16S1QI -->
                <device Dname="MDR32FG16S1QI">
                    <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000"/>
                    <compile    header="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\inc\MDR32FG16S1QI.h"/>
                    <debug      svd="IDE\SVD\MDR32FG16S1QI.svd"/>
                    <memory     id="IROM1"                                 start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory     id="IRAM1"                                 start="0x20000000" size="0x8000"  init   ="0" default="1"/>
                    <algorithm  name="FLM\MDR32FG16S1QI\MDR32FG16S1QI.FLM" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
                    <description>
MDR32FG16S1QI (K1901VC1QI RUS)
Core:
 - 32-bit RISC processor, running at frequencies of up to 100 MHz
 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
 - memory Protection Unit (MPU)
 - 24-bit SysTick Timer
DSP Core:
 - TMS320C54 16-bit DSP Core analog, 100MHz
 - 128 KBytes Data RAM
 - 128 KBytes Program RAM

Memory:
 - 128 KBytes of Flash memory (ISP and IAP)
 - 32 KBytes of SRAM
 - external system bus controller (support of SRAM, ROM and NAND Flash)

Supply and Clock rate:
 - internal regulator for core voltage supply
 - built-in power control system
 - internal battery domain
 - internal 8 MHz RC clock generator with calibration
 - internal 40 kHz RC clock generator with calibration
 - external oscillator 2 .. 16 MHz
 - external oscillator 32 KHz
 - on-board PLL for clock frequency
 - dedicated PLL for USB clock frequency

Low power consumption modes:
 - Sleep, Stop and Standby
 - battery domain with RTC and backup registers

Analog features:
 - 2 * 12-bit ADC (16 channels)
 - conversion range: 0 to 3.6 V
 - temperature sensor
 - 1 * 12-bit DAC
 - internal comparator

Peripheral features:
 - DMA controller (32 channels)
 - USB 1.0 full-speed controller (Device and Host)
 - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
 - 2 * CAN interface (2.0B)
 - 3 * UART
 - 2 * SPI
 - 1 * I2C
 - 96 GPIO pins

Debug mode:
 - 2 * JTAG and SWD
                    </description>
                </device>
            </subFamily>
        </family>
    </devices>


    <conditions>
        <!-- Compiler Conditions -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="GCC Compiler">
            <require Tcompiler="GCC"/>
        </condition>
        <!-- Device Conditions -->
        <condition id="CON_MDR32F1QI">
            <description>MDR32F1QI device</description>
            <require Dvendor="Milandr:99" Dname="MDR32F1QI"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_K1986VE1xI">
            <description>K1986VE1xI (K1986VE1FI, K1986VE1GI) devices</description>
            <require Dvendor="Milandr:99" Dname="K1986VE1xI"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_MDR32F1QI_K1986VE1xI">
            <description>MDR32F1QI, K1986VE1xI device</description>
            <accept condition="CON_MDR32F1QI"/>
            <accept condition="CON_K1986VE1xI"/>
        </condition>
        
        <condition id="CON_MDR32F9Q2I">
            <description>MDR32F9Q2I device</description>
            <require Dvendor="Milandr:99" Dname="MDR32F9Q2I"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_K1986VE92xI">
            <description>K1986VE92F(1)I device</description>
            <require Dvendor="Milandr:99" Dname="K1986VE92xI"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_K1986VE92F1I">
            <description>K1986VE92F1I device</description>
            <require Dvendor="Milandr:99" Dname="K1986VE92F1I"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_K1986VE94GI">
            <description>K1986VE94GI device</description>
            <require Dvendor="Milandr:99" Dname="K1986VE94GI"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        <condition id="CON_K1986VE9xI">
            <description>K1986VE9xI series device</description>
            <accept condition="CON_MDR32F9Q2I"/>
            <accept condition="CON_K1986VE92xI"/>
            <accept condition="CON_K1986VE94GI"/>
        </condition>
        
        <condition id="CON_MDR32FG16S1QI">
            <description>MDR32FG16S1QI device</description>
            <require Dvendor="Milandr:99" Dname="MDR32FG16S1QI"/>
            <require Cclass="Device" Cgroup="Startup"/>
        </condition>
        
        
        <condition id="CON_K1986VE9xI_MDR32FG16S1QI">
            <description>K1986VE9xI series device or MDR32FG16S1QI device</description>
            <accept condition="CON_K1986VE9xI"/>
            <accept condition="CON_MDR32FG16S1QI"/>
        </condition>
        <condition id="CON_K1986VE9xI_K1986VE1xI">
            <description>K1986VE9xI series device or K1986VE1xI device</description>
            <accept condition="CON_K1986VE9xI"/>
            <accept condition="CON_MDR32F1QI_K1986VE1xI"/>
        </condition>
        
