unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
        <condition id="CON_MDR32FxQI">
            <description>MDR32FxQI series device</description>
            <accept condition="CON_MDR32F1QI_K1986VE1xI"/>
            <accept condition="CON_K1986VE9xI"/>
            <accept condition="CON_MDR32FG16S1QI"/>
        </condition>
        
        <!-- Device + Driver Conditions -->
        <condition id="CON_MDR32F1QI_K1986VE1xI_ETH_DEPENDENCIES_DMA_RST_CLK_UTILS">
            <description>K1986VE1xI device with ETH dependencies (DMA, RST_CLK and UTILS)</description>
            <require condition="CON_MDR32F1QI_K1986VE1xI"/>
            <require Cclass="Drivers" Cgroup="DMA"/>
            <require Cclass="Drivers" Cgroup="RST_CLK"/>
            <require Cclass="Drivers" Cgroup="UTILS"/>
        </condition>
        <condition id="CON_MDR32FxQI_UART_DENPENDENCIES_RST_CLK">
            <description>MDR32FxQI series device with UART dependencies (RST_CLK)</description>
            <require condition="CON_MDR32FxQI"/>
            <require Cclass="Drivers" Cgroup="RST_CLK"/>
        </condition>
        <condition id="CON_MDR32FxQI_USBLIB_DENPENDENCIES_USB">
            <description>MDR32FxQI series device with USB_LIB dependencies (USB)</description>
            <require condition="CON_MDR32FxQI"/>
            <require Cclass="Drivers" Cgroup="USB"/>
        </condition>
        <condition id="CON_MDR32FxQI_EEPROM_DENPENDENCIES_UTILS">
            <description>MDR32FxQI series device, EEPROM dependencies (UTILS)</description>
            <require condition="CON_MDR32FxQI"/>
            <require Cclass="Drivers" Cgroup="UTILS"/>
        </condition>
        <condition id="CON_MDR32FxQI_UTILS_DENPENDENCIES_RST_CLK">
            <description>MDR32FxQI series device, UTILS dependencies (RST_CLK)</description>
            <require condition="CON_MDR32FxQI"/>
            <require Cclass="Drivers" Cgroup="RST_CLK"/>
        </condition>
    </conditions>


    <components>
        <!-- MDR32F9Q2I Startup -->
        <component Cclass="Device" Cgroup="Startup" Cversion="2.2.0i" condition="CON_MDR32F9Q2I">
            <description>System and startup files for MDR32F9Q2I device</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_MDR32F9Q2I
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\startup\arm\startup_MDR32F9Q2I.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\startup\gcc\startup_MDR32F9Q2I.c" attr="config" condition="GCC Compiler"/>				
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\startup\system_MDR32F9Q2I.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\startup\system_MDR32F9Q2I.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F9Q2I\inc\MDR32F9Q2I.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM3\core_cm3.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\MDR32F9Q2I.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\MDR32F9Q2I_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\MDR32F9Q2I_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        <!-- K1986VE92F(1)I Startup -->
        <component Cclass="Device" Cgroup="Startup" Cversion="2.2.0i" condition="CON_K1986VE92xI">
            <description>System and startup files for K1986VE92F(1)I device</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_K1986VE92xI
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\arm\startup_K1986VE9xI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\gcc\startup_K1986VE9xI.c" attr="config" condition="GCC Compiler"/>
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\system_K1986VE9xI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\system_K1986VE9xI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\inc\K1986VE9xI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM3\core_cm3.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\K1986VE9xI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\K1986VE9xI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\K1986VE9xI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        <!-- K1986VE94GI Startup -->
        <component Cclass="Device" Cgroup="Startup" Cversion="2.2.0i" condition="CON_K1986VE94GI">
            <description>System and startup files for K1986VE94GI device</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_K1986VE94GI
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\arm\startup_K1986VE9xI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\gcc\startup_K1986VE9xI.c" attr="config" condition="GCC Compiler"/>				
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\system_K1986VE9xI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\startup\system_K1986VE9xI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE9xI\inc\K1986VE9xI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM3\core_cm3.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\K1986VE9xI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\K1986VE9xI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\K1986VE9xI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        
        <!-- MDR32F1QI REV6 Startup -->
        <component Cclass="Device" Cgroup="Startup" Cvariant="1. Rev.6+" Cversion="2.2.0i" condition="CON_MDR32F1QI">
            <description>System and startup files for MDR32F1QI device revisions 6 and higher. Defines USE_MDR32F1QI_REV6</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_MDR32F1QI_REV6
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\arm\startup_MDR32F1QI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\gcc\startup_MDR32F1QI.S" attr="config" condition="GCC Compiler"/>								
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\system_MDR32F1QI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\system_MDR32F1QI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\inc\MDR32F1QI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM1\core_cm1.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\MDR32F1QI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\MDR32F1QI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\MDR32F1QI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
