unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
        <!-- MDR32F1QI REV3_4 Startup -->
        <component Cclass="Device" Cgroup="Startup" Cvariant="2. Rev.3 or Rev.4" Cversion="2.2.0i" condition="CON_MDR32F1QI">
            <description>System and startup files for MDR32F1QI device revisions 3 and 4. Defines USE_MDR32F1QI_REV3_4</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_MDR32F1QI_REV3_4
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\arm\startup_MDR32F1QI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\gcc\startup_MDR32F1QI.S" attr="config" condition="GCC Compiler"/>				
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\system_MDR32F1QI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\startup\system_MDR32F1QI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32F1QI\inc\MDR32F1QI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM1\core_cm1.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\MDR32F1QI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\MDR32F1QI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\MDR32F1QI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        <!-- K1986VE1FI, K1986VE1GI Startup -->
        <component Cclass="Device" Cgroup="Startup" Cversion="2.2.0i" condition="CON_K1986VE1xI">
            <description>System and startup files for K1986VE1FI, K1986VE1GI devices.</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_K1986VE1xI
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\startup\arm\startup_K1986VE1xI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\startup\gcc\startup_K1986VE1xI.S" attr="config" condition="GCC Compiler"/>				
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\startup\system_K1986VE1xI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\startup\system_K1986VE1xI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\K1986VE1xI\inc\K1986VE1xI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM1\core_cm1.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\K1986VE1xI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\K1986VE1xI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\K1986VE1xI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        
        <!-- MDR32FG16S1QI Startup -->
        <component Cclass="Device" Cgroup="Startup" Cversion="2.1.0i" condition="CON_MDR32FG16S1QI">
            <description>System and startup files for MDR32FG16S1QI device</description>
            <RTE_Components_h>
/* Target microcontroller definition */
#define USE_MDR32FG16S1QI
            </RTE_Components_h>
            <files>
                <!-- startup files -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\startup\arm\startup_MDR32FG16S1QI.S" attr="config" condition="Compiler ARMCC"/>
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\startup\gcc\startup_MDR32FG16S1QI.c" attr="config" condition="GCC Compiler"/>				
                <!-- system file -->
                <file category="source" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\startup\system_MDR32FG16S1QI.c" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\startup\system_MDR32FG16S1QI.h" attr="config"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\DeviceSupport\MDR32FG16S1QI\inc\MDR32FG16S1QI.h"/>
                <!-- header file -->
                <file category="header" name="Libraries\CMSIS\MDR32FxQI\CoreSupport\CM3\core_cm3.h" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\MDR32FxQI_config.h" attr="config"/>
                <!-- linker file -->
                <file category="linkerScript" name="IDE\scatter\MDR32FG16S1QI.sct" attr="config" condition="Compiler ARMCC"/>
                <!-- header file -->
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\IRQ_Handler_Template\MDR32FG16S1QI_IT.h" attr="template" select="IT Handlers Template"/>
                <!-- source file -->
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\IRQ_Handler_Template\MDR32FG16S1QI_IT.c" attr="template" select="IT Handlers Template"/>
            </files>
        </component>
        
        <!-- ____________________ Peripheral Drivers _______________________ -->
        <!-- _________________________ MDR32FxQI ___________________________ -->
        <!-- ADC Driver -->
        <component Cclass="Drivers" Cgroup="ADC" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>ADC driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_adc.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_adc.c"/>
            </files>
        </component>
        
        <!-- BKP Driver -->
        <component Cclass="Drivers" Cgroup="BKP" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>BKP driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_bkp.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_bkp.c"/>
            </files>
        </component>
        
        <!-- CAN Driver -->
        <component Cclass="Drivers" Cgroup="CAN" Cversion="2.2.0i" condition="CON_K1986VE9xI_K1986VE1xI">
            <description>CAN driver for MDR32F9Q2I and MDR32F1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_can.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_can.c"/>
            </files>
        </component>
        
