unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
        <!-- COMP Driver -->
        <component Cclass="Drivers" Cgroup="COMP" Cversion="2.2.0i" condition="CON_K1986VE9xI_MDR32FG16S1QI">
            <description>COMP driver for MDR32F9Q2I and MDR32FG16S1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_comp.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_comp.c"/>
            </files>
        </component>
        
        <!-- DAC Driver -->
        <component Cclass="Drivers" Cgroup="DAC" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>DAC driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_dac.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_dac.c"/>
            </files>
        </component>
        
        <!-- DMA Driver -->
        <component Cclass="Drivers" Cgroup="DMA" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>DMA driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_dma.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_dma.c"/>
            </files>
        </component>
        
        <!-- EBC Driver -->
        <component Cclass="Drivers" Cgroup="EBC" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>EBC driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_ebc.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_ebc.c"/>
            </files>
        </component>
        
        <!-- EEPROM Driver -->
        <component Cclass="Drivers" Cgroup="EEPROM" Cversion="2.2.0i" condition="CON_MDR32FxQI_EEPROM_DENPENDENCIES_UTILS">
            <description>EEPROM driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_eeprom.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_eeprom.c"/>
                <file category="sourceAsm" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_asm.S"/>
            </files>
        </component>
        
        <!-- I2C Driver -->
        <component Cclass="Drivers" Cgroup="I2C" Cversion="2.2.0i" condition="CON_K1986VE9xI_MDR32FG16S1QI">
            <description>I2C driver for MDR32F9Q2I and MDR32FG16S1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_i2c.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_i2c.c"/>
            </files>
        </component>
        
        <!-- IWDG Driver -->
        <component Cclass="Drivers" Cgroup="IWDG" Cversion="2.0.3i" condition="CON_MDR32FxQI">
            <description>IWDG driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_iwdg.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_iwdg.c"/>
            </files>
        </component>
        
        <!-- PORT Driver -->
        <component Cclass="Drivers" Cgroup="PORT" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>PORT driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_port.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_port.c"/>
            </files>
        </component>
        
        <!-- POWER Driver -->
        <component Cclass="Drivers" Cgroup="POWER" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>POWER driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_power.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_power.c"/>
            </files>
        </component>
        
        <!-- RST_CLK Driver -->
        <component Cclass="Drivers" Cgroup="RST_CLK" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>RST_CLK driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_rst_clk.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_rst_clk.c"/>
            </files>
        </component>
        
        <!-- SSP Driver -->
        <component Cclass="Drivers" Cgroup="SSP" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>SSP driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_ssp.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_ssp.c"/>
            </files>
        </component>
        
        <!-- TIMER Driver -->
        <component Cclass="Drivers" Cgroup="TIMER" Cversion="2.2.0i" condition="CON_MDR32FxQI">
            <description>TIMER driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_timer.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_timer.c"/>
            </files>
        </component>
        
        <!-- UART Driver -->
        <component Cclass="Drivers" Cgroup="UART" Cversion="2.2.0i" condition="CON_MDR32FxQI_UART_DENPENDENCIES_RST_CLK">
            <description>UART driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_uart.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_uart.c"/>
            </files>
        </component>
        
        <!-- WWDG Driver -->
        <component Cclass="Drivers" Cgroup="WWDG" Cversion="2.0.3i" condition="CON_MDR32FxQI">
            <description>WWDG driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_wwdg.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_wwdg.c"/>
            </files>
        </component>
        
        <!-- MIL_STD_1553 Driver -->
        <component Cclass="Drivers" Cgroup="MIL_STD_1553" Cversion="2.1.0i" condition="CON_MDR32F1QI_K1986VE1xI">
            <description>MIL_STD_1553 driver for MDR32F1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_mil_std_1553.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_mil_std_1553.c"/>
            </files>
        </component>
        
        <!-- ARINC429R Driver -->
        <component Cclass="Drivers" Cgroup="ARINC429R" Cversion="2.1.0i" condition="CON_MDR32F1QI_K1986VE1xI">
            <description>ARINC429R driver for MDR32F1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_arinc429r.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_arinc429r.c"/>
            </files>
        </component>
        
        <!-- ARINC429T Driver -->
        <component Cclass="Drivers" Cgroup="ARINC429T" Cversion="2.1.0i" condition="CON_MDR32F1QI_K1986VE1xI">
            <description>ARINC429T driver for MDR32F1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_arinc429t.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_arinc429t.c"/>
            </files>
        </component>
        
        <!-- Ethernet Driver -->
        <component Cclass="Drivers" Cgroup="Ethernet" Cversion="2.2.0i" condition="CON_MDR32F1QI_K1986VE1xI_ETH_DEPENDENCIES_DMA_RST_CLK_UTILS">
            <description>Ethernet driver for MDR32F1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_eth.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_eth.c"/>
            </files>
        </component>
        
        <!-- USB Driver -->
        <component Cclass="Drivers" Cgroup="USB" Cversion="2.1.0i" condition="CON_MDR32FxQI">
            <description>USB driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_usb.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_usb.c"/>
            </files>
        </component>
        
