unsi9ned/Milandr.MDR32FxQI_DFP/Milandr.MDR32FxQI.pdsc
        <!-- USB Library Driver -->
        <component Cclass="Drivers" Cgroup="USB Library" Cversion="2.1.0i" condition="CON_MDR32FxQI_USBLIB_DENPENDENCIES_USB">
            <description>USB Library for MDR32FxQI Devices</description>
            <files>
                <file category="doc"    name="Libraries\SPL\MDR32FxQI\inc\USB_Library\MDR32FxQI_USB_Library.pdf"/>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\USB_Library\MDR32FxQI_usb_CDC.h"/>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\USB_Library\MDR32FxQI_usb_device.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\USB_Library\MDR32FxQI_usb_CDC.c"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\USB_Library\MDR32FxQI_usb_device.c"/>
            </files>
        </component>
        
        <!-- SDIO Driver -->
        <component Cclass="Drivers" Cgroup="SDIO" Cversion="2.0.3i" condition="CON_MDR32FG16S1QI">
            <description>SDIO driver for MDR32FG16S1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_sdio.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_sdio.c"/>
            </files>
        </component>
        
        <!-- Audio Driver -->
        <component Cclass="Drivers" Cgroup="Audio" Cversion="2.1.0i" condition="CON_MDR32FG16S1QI">
            <description>Audio driver for MDR32FG16S1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_audio.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_audio.c"/>
            </files>
        </component>
        
        <!-- DSP Driver -->
        <component Cclass="Drivers" Cgroup="DSP" Cversion="2.0.3i" condition="CON_MDR32FG16S1QI">
            <description>DSP driver for MDR32FG16S1QI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_dsp.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_dsp.c"/>
            </files>
        </component>
        
        <!-- UTILS Driver -->
        <component Cclass="Drivers" Cgroup="UTILS" Cversion="1.2.0i" condition="CON_MDR32FxQI_UTILS_DENPENDENCIES_RST_CLK">
            <description>Utils driver for MDR32FxQI Devices</description>
            <files>
                <file category="header" name="Libraries\SPL\MDR32FxQI\inc\MDR32FxQI_utils.h"/>
                <file category="source" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_utils.c"/>
                <file category="sourceAsm" name="Libraries\SPL\MDR32FxQI\src\MDR32FxQI_asm.S"/>
            </files>
        </component>

    </components>


</package>

